{
    "work": [
        {
            "company": "VIBBIO",
            "location": "Oslo (NO) - Remote",
            "website": "https://www.vibbio.com",
            "experience": [
                {
                    "position": "Tech Lead",
                    "startDate": "Nov 2021",
                    "endDate": "Current",
                    "highlights": [
                        "Develop and maintain the core video rendering engine, based on Remotion, on an AWS Elastic Beanstalk environment with continuous integration, auto-scaling, load balancing, express, and WebSocket servers to serve the application and update the clients on the state of the rendering job.",
                        "Rewrite the technical foundation of the product: after the rewrite, we could ship new and improved features (often impossible/very difficult to implement before) faster and with fewer bugs.",
                        "Own the vision and communicate development activities and product capabilities to various stakeholders in support of the CEO."
                    ]
                },
                {
                    "position": "Senior Full Stack Developer",
                    "startDate": "Jun 2020",
                    "endDate": "Nov 2021",
                    "highlights": [
                        "Contribute to the product roadmap and design research activities.",
                        "Monitor, improve, develop and maintain the product to meet good quality standards.",
                        "Lead, mentor, and support less experienced members of the team.",
                        "Rewrite the entire core rendering engine of the company and other key modules with a new and more flexible framework to expand on its capabilities and allow for a better developer experience.",
                        "Maintain and develop the main company application: a React JS video editing tool with media importing, screen recording (audio and/or video), image manipulation, and background music selection.",
                        "Develop multiple NPM packages used both on the frontend and the backend as part of the company codebase, allowing the product to be as modular as possible to unlock various integrations and flexibility in its usage.",
                        "Collect feedback from customers and propose new features to be discussed with the rest of the team via Request For Comments on Github."
                    ]
                }
            ]
        },
        {
            "company": "SosTariffe.it",
            "location": "Cascina (PI)",
            "website": "https://www.sostariffe.it/",
            "experience": [
                {
                    "position": "Full-Stack Developer",
                    "startDate": "Sep 2017",
                    "endDate": "Jun 2020",
                    "highlights": [
                        "React JS application for car/motorbike insurance quotes online comparison. The app collects the user’s info, vehicle details and insurance history and shows insurance quotes based on those data.",
                        "Backend API for the insurance quotes comparison application: user’s data managing and communication between our servers and the insurance companies' web services.",
                        "Refactor of older javascript applications and porting of legacy modules into React JS components."
                    ]
                }
            ]
        },
        {
            "company": "iDNA - Digital Natural Agency",
            "location": "Navacchio (PI)",
            "website": "https://www.idna.it/",
            "experience": [
                {
                    "position": "Web Developer",
                    "startDate": "Nov 2015",
                    "endDate": "Sep 2017",
                    "highlights": [
                        "Javascript/React JS single-page applications for Spotify Italia’s advertising campaigns, using their APIs for collecting, analyzing and editing Spotify users’ playlists",
                        "PHP applications, specifically based on the Fat-free framework, mainly for Spotify Italia.",
                        "WordPress and Joomla company websites.",
                        "System admin (mainly DNS and Hosts configurations on the company and clients servers)."
                    ]
                }
            ]
        },
        {
            "company": "Nuovosito.it - Dami Communication",
            "location": "Pisa (PI)",
            "website": "http://www.nuovosito.it/",
            "experience": [
                {
                    "position": "Web Developer",
                    "startDate": "Feb 2015",
                    "endDate": "Sep 2015",
                    "highlights": [
                        "HTML5/CSS 3 + Javascript/PHP websites for small companies.",
                        "Update of obsolete legacy websites.",
                        "Search Engine Optimization for clients websites."
                    ]
                }
            ]
        }
    ],
    "skills": [
        {
            "name": "Frontend",
            "keywords": [
                "React JS",
                "Redux",
                "Javascript",
                "11ty",
                "HTML5",
                "CSS3",
                "SASS"
            ]
        },
        {
            "name": "Backend",
            "keywords": [
                "Node JS",
                "AWS Elastic Beanstalk",
                "AWS Lambda functions",
                "Google Cloud Functions",
                "Architect",
                "PHP",
                "REST API"
            ]
        },
        {
            "name": "CMS",
            "keywords": [
                "Netlify CMS",
                "Sanity.io",
                "WordPress",
                "Joomla"
            ]
        },
        {
            "name": "Workflow",
            "keywords": [
                "Git",
                "GitFlow",
                "AWS CLI",
                "Webpack",
                "Unix shell"
            ]
        },
        {
            "name": "Languages",
            "keywords": [
                "Italian",
                "English"
            ]
        }
    ],
    "education": {
        "type": "High School Diploma",
        "school": "Liceo Classico Giuseppe Manno",
        "location": "Alghero (SS)",
        "startDate": "2003",
        "endDate": "2008",
        "gpa": "96/100"
    }
}